[{"_id":"608642dea3289e5eb40d4187","strMeal":"French ice cream","strInstructions":"test","strIngredient1":"egg","strIngredient2":"milk","strIngredient3":"cream","strIngredient4":"","strIngredient5":"","strMeasure1":"2","strMeasure2":"12oz","strMeasure3":"12oz","strMeasure4":"","strMeasure5":"","strMealThumb":"","username":"","strArea":"French","strCategory":"Dessert","__v":0},{"_id":"60865006a3289e5eb40d4188","strMeal":"Vanilla Bean Ice Cream","strInstructions":"1. Warm the milk, sugar, 1 cup of the heavy cream and the salt in a medium saucepan over low heat, stirring until the sugar is dissolved. Scrape the seeds from the vanilla bean into the milk mixture and add the bean to the mixture as well. Cover, remove from the heat and let steep at room temperature for 30 minutes.\n2. Pour the remaining 1 cup heavy cream into a large bowl and place a fine-mesh sieve on top. Whisk the egg yolks in a medium bowl. Slowly pour the warmed milk mixture into the egg yolks, whisking constantly. Scrape the mixture back into the saucepan.\n3. Place the saucepan over medium heat and stir constantly with a rubber spatula, being sure to scrape the bottom of the pan as you stir, until the mixture thickens and coats the back of the spatula, a few minutes. The mixture should register 170 to 175 degrees F on an instant-read digital thermometer.\nPour the custard through the fine-mesh sieve and stir it into the cream. Place the vanilla bean into the custard, stir in the vanilla extract, and place the bowl over an ice bath. Stir occasionally, until the mixture is cool. Cover and transfer the custard to the refrigerator until completely chilled, at least 8 hours or overnight.\n4. When ready to churn the ice cream, remove the vanilla bean from the custard and freeze the mixture in your ice cream maker according to the manufacturer's instructions. Transfer to a freezer-safe container and store in the freezer.","strIngredient1":"egg","strIngredient2":"milk","strIngredient3":"vanilla bean","strIngredient4":"","strIngredient5":"","strMeasure1":"2","strMeasure2":"16oz","strMeasure3":"2 drop","strMeasure4":"","strMeasure5":"","strMealThumb":"https://www.browneyedbaker.com/wp-content/uploads/2013/05/vanilla-bean-ice-cream-29-600.jpg","username":"","strArea":"America","strCategory":"Dessert","__v":0},{"_id":"608668ce3109084cd812fac4","strMeal":"egg","strInstructions":"In a wok add chicken broth and wait for it to boil. Next add salt, sugar, white pepper, sesame seed oil. When the chicken broth is boiling add the vegetables to the wok. To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness. Next add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds Serve the soup in a bowl and add the green onions on top.","strIngredient1":"egg","strIngredient2":"water","strIngredient3":"","strIngredient4":"","strIngredient5":"","strMeasure1":"2","strMeasure2":"10oz","strMeasure3":"","strMeasure4":"","strMeasure5":"","strMealThumb":"https://www.themealdb.com/images/media/meals/1529446137.jpg","username":"","strArea":"Chinese","strCategory":"Soup","__v":0},{"_id":"60877ec3840a6205c8437de8","strMeal":"beef","strInstructions":"STEP 1 - MARINATING THE BEEF In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together. STEP 2 - BOILING THE THE NOODLES In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water. STEP 3 - STIR FRY Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked. Set the cooked beef aside In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water. Add the noodles to wok To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce. Next add the beef to wok and stir-fry","strIngredient1":"Beef","strIngredient2":"Salt","strIngredient3":"Pepper","strIngredient4":"","strIngredient5":"","strMeasure1":"1LB","strMeasure2":"10g","strMeasure3":"10g","strMeasure4":"","strMeasure5":"","strMealThumb":"https://www.themealdb.com/images/media/meals/1529444830.jpg","username":"Zhang-Chef","strArea":"Chinese","strCategory":"Beef","__v":0}]